adapters/adorsys-integ-adapter/src/test/resources/pis/payments/get-status/response-body.json

{
  "endToEndIdentification": "SandboxTPPTest1",
  "debtorName": "Mocked debtor name from ASPSP",
  "debtorAccount": {
    "iban": "DE38760700240320465700",
    "currency": "EUR"
  },
  "instructedAmount": {
    "currency": "EUR",
    "amount": "20.99"
  },
  "creditorAccount": {
    "iban": "DE38760700240320465700",
    "currency": "EUR"
  },
  "creditorName": "Merchant123",
  "remittanceInformationUnstructured": "just",
  "transactionStatus": "ACCC"
}
